Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.53/atdf/ATSAMA5D21.atdf
        <register caption="PTP Peer Event Frame Received Nanoseconds Register" name="GMAC_PEFRN" offset="0x1FC" rw="R" size="4">
          <bitfield caption="Register Update" mask="0x3FFFFFFF" name="RUD"/>
        </register>
        <register caption="Received LPI Transitions" name="GMAC_RXLPI" offset="0x270" rw="R" size="4">
          <bitfield caption="Count of RX LPI transitions (cleared on read)" mask="0x0000FFFF" name="COUNT"/>
        </register>
        <register caption="Received LPI Time" name="GMAC_RXLPITIME" offset="0x274" rw="R" size="4">
          <bitfield caption="Time in LPI (cleared on read)" mask="0x00FFFFFF" name="LPITIME"/>
        </register>
        <register caption="Transmit LPI Transitions" name="GMAC_TXLPI" offset="0x278" rw="R" size="4">
          <bitfield caption="Count of LPI transitions (cleared on read)" mask="0x0000FFFF" name="COUNT"/>
        </register>
        <register caption="Transmit LPI Time" name="GMAC_TXLPITIME" offset="0x27C" rw="R" size="4">
          <bitfield caption="Time in LPI (cleared on read)" mask="0x00FFFFFF" name="LPITIME"/>
        </register>
        <register caption="Interrupt Status Register Priority Queue (1..2)" name="GMAC_ISRPQ" offset="0x400" rw="R" size="4" count="2" atomic-op="clear:GMAC_ISRPQ">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Transmit Buffer Queue Base Address Register Priority Queue (1..2)" name="GMAC_TBQBAPQ" offset="0x440" rw="RW" size="4" count="2">
          <bitfield caption="Transmit Buffer Queue Base Address" mask="0xFFFFFFFC" name="TXBQBA"/>
        </register>
        <register caption="Receive Buffer Queue Base Address Register Priority Queue (1..2)" name="GMAC_RBQBAPQ" offset="0x480" rw="RW" size="4" count="2">
          <bitfield caption="Receive Buffer Queue Base Address" mask="0xFFFFFFFC" name="RXBQBA"/>
        </register>
        <register caption="Receive Buffer Size Register Priority Queue (1..2)" name="GMAC_RBSRPQ" offset="0x4A0" rw="RW" size="4" count="2">
          <bitfield caption="Receive Buffer Size" mask="0x0000FFFF" name="RBS"/>
        </register>
        <register caption="Credit-Based Shaping Control Register" name="GMAC_CBSCR" offset="0x4BC" rw="RW" size="4">
          <bitfield caption="Queue B CBS Enable" mask="0x00000001" name="QBE"/>
          <bitfield caption="Queue A CBS Enable" mask="0x00000002" name="QAE"/>
        </register>
        <register caption="Credit-Based Shaping IdleSlope Register for Queue A" name="GMAC_CBSISQA" offset="0x4C0" rw="RW" size="4">
          <bitfield caption="IdleSlope" mask="0xFFFFFFFF" name="IS"/>
        </register>
        <register caption="Credit-Based Shaping IdleSlope Register for Queue B" name="GMAC_CBSISQB" offset="0x4C4" rw="RW" size="4">
          <bitfield caption="IdleSlope" mask="0xFFFFFFFF" name="IS"/>
        </register>
        <register caption="Screening Type 1 Register Priority Queue" name="GMAC_ST1RPQ" offset="0x500" rw="RW" size="4" count="4">
          <bitfield caption="Queue Number (0-2)" mask="0x00000007" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type 2 Register Priority Queue" name="GMAC_ST2RPQ" offset="0x540" rw="RW" size="4" count="8">
          <bitfield caption="Queue Number (0-2)" mask="0x00000007" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x00000070" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
          <bitfield caption="Index of Screening Type 2 EtherType register x" mask="0x00000E00" name="I2ETH"/>
          <bitfield caption="EtherType Enable" mask="0x00001000" name="ETHE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x0003E000" name="COMPA"/>
          <bitfield caption="Compare A Enable" mask="0x00040000" name="COMPAE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x00F80000" name="COMPB"/>
          <bitfield caption="Compare B Enable" mask="0x01000000" name="COMPBE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x3E000000" name="COMPC"/>
          <bitfield caption="Compare C Enable" mask="0x40000000" name="COMPCE"/>
        </register>
        <register caption="Interrupt Enable Register Priority Queue (1..2)" name="GMAC_IERPQ" offset="0x600" rw="W" size="4" count="2" atomic-op="set:GMAC_IMRPQ">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Disable Register Priority Queue (1..2)" name="GMAC_IDRPQ" offset="0x620" rw="W" size="4" count="2" atomic-op="clear:GMAC_IMRPQ">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Mask Register Priority Queue (1..2)" name="GMAC_IMRPQ" offset="0x640" rw="RW" size="4" count="2" atomic-op="read:GMAC_IMRPQ">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="AHB Error" mask="0x00000040" name="AHB"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Screening Type 2 Ethertype Register" name="GMAC_ST2ER" offset="0x6E0" rw="RW" size="4" count="4">
          <bitfield caption="Ethertype Compare Value" mask="0x0000FFFF" name="COMPVAL"/>
        </register>
