Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.53/atdf/ATSAMA5D21.atdf
        <register caption="Security Peripheral Select 1 Register" count="3" name="MATRIX_SPSELR" offset="0x02C0" rw="RW" size="4">
          <bitfield caption="Non-secured Peripheral" mask="0x00000001" name="NSECP0"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000002" name="NSECP1"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000004" name="NSECP2"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000008" name="NSECP3"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000010" name="NSECP4"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000020" name="NSECP5"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000040" name="NSECP6"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000080" name="NSECP7"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000100" name="NSECP8"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000200" name="NSECP9"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000400" name="NSECP10"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00000800" name="NSECP11"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00001000" name="NSECP12"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00002000" name="NSECP13"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00004000" name="NSECP14"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00008000" name="NSECP15"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00010000" name="NSECP16"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00020000" name="NSECP17"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00040000" name="NSECP18"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00080000" name="NSECP19"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00100000" name="NSECP20"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00200000" name="NSECP21"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00400000" name="NSECP22"/>
          <bitfield caption="Non-secured Peripheral" mask="0x00800000" name="NSECP23"/>
          <bitfield caption="Non-secured Peripheral" mask="0x01000000" name="NSECP24"/>
          <bitfield caption="Non-secured Peripheral" mask="0x02000000" name="NSECP25"/>
          <bitfield caption="Non-secured Peripheral" mask="0x04000000" name="NSECP26"/>
          <bitfield caption="Non-secured Peripheral" mask="0x08000000" name="NSECP27"/>
          <bitfield caption="Non-secured Peripheral" mask="0x10000000" name="NSECP28"/>
          <bitfield caption="Non-secured Peripheral" mask="0x20000000" name="NSECP29"/>
          <bitfield caption="Non-secured Peripheral" mask="0x40000000" name="NSECP30"/>
          <bitfield caption="Non-secured Peripheral" mask="0x80000000" name="NSECP31"/>
        </register>
      </register-group>
      <value-group caption="Undefined Length Burst Type" name="MATRIX_MCFG__ULBT">
        <value caption="Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave." name="UNLIMITED" value="0x0"/>
        <value caption="Single Access-The undefined length burst is treated as a succession of single accesses, allowing rearbitration at each beat of the INCR burst or bursts sequence." name="SINGLE" value="0x1"/>
        <value caption="4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing rearbitration every 4 beats." name="_4_BEAT" value="0x2"/>
        <value caption="8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing rearbitration every 8 beats." name="_8_BEAT" value="0x3"/>
        <value caption="16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing rearbitration every 16 beats." name="_16_BEAT" value="0x4"/>
        <value caption="32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing rearbitration every 32 beats." name="_32_BEAT" value="0x5"/>
        <value caption="64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing rearbitration every 64 beats." name="_64_BEAT" value="0x6"/>
        <value caption="128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing rearbitration every 128 beats.Unless duly needed, the ULBT should be left at its default 0 value for power saving." name="_128_BEAT" value="0x7"/>
      </value-group>
      <value-group caption="Default Master Type" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access." name="NONE" value="0x0"/>
        <value caption="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
