Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.53/atdf/ATSAMA5D21.atdf
        <register caption="Status Register" name="PIT_SR" offset="0x04" rw="R" size="4">
          <bitfield caption="Periodic Interval Timer Status" mask="0x00000001" name="PITS"/>
        </register>
        <register caption="Periodic Interval Value Register" name="PIT_PIVR" offset="0x08" rw="R" size="4">
          <bitfield caption="Current Periodic Interval Value" mask="0x000FFFFF" name="CPIV"/>
          <bitfield caption="Periodic Interval Counter" mask="0xFFF00000" name="PICNT"/>
        </register>
        <register caption="Periodic Interval Image Register" name="PIT_PIIR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Current Periodic Interval Value" mask="0x000FFFFF" name="CPIV"/>
          <bitfield caption="Periodic Interval Counter" mask="0xFFF00000" name="PICNT"/>
        </register>
      </register-group>
    </module>
    <module caption="Power Management Controller" id="11041" name="PMC" version="ZD">
      <register-group name="PMC">
        <register caption="System Clock Enable Register" name="PMC_SCER" offset="0x0000" rw="W" size="4">
          <bitfield caption="DDR Clock Enable" mask="0x00000004" name="DDRCK"/>
          <bitfield caption="MCK2x Clock Enable" mask="0x00000008" name="LCDCK"/>
          <bitfield caption="USB Host OHCI Clocks Enable" mask="0x00000040" name="UHP"/>
          <bitfield caption="USB Device Clock Enable" mask="0x00000080" name="UDP"/>
          <bitfield caption="Programmable Clock 0 Output Enable" mask="0x00000100" name="PCK0"/>
          <bitfield caption="Programmable Clock 1 Output Enable" mask="0x00000200" name="PCK1"/>
          <bitfield caption="Programmable Clock 2 Output Enable" mask="0x00000400" name="PCK2"/>
          <bitfield caption="ISC Clock Enable" mask="0x00040000" name="ISCCK"/>
        </register>
        <register caption="System Clock Disable Register" name="PMC_SCDR" offset="0x0004" rw="W" size="4">
          <bitfield caption="Processor Clock Disable" mask="0x00000001" name="PCK"/>
          <bitfield caption="DDR Clock Disable" mask="0x00000004" name="DDRCK"/>
          <bitfield caption="MCK2x Clock Disable" mask="0x00000008" name="LCDCK"/>
          <bitfield caption="USB Host OHCI Clock Disable" mask="0x00000040" name="UHP"/>
          <bitfield caption="USB Device Clock Enable" mask="0x00000080" name="UDP"/>
          <bitfield caption="Programmable Clock 0 Output Disable" mask="0x00000100" name="PCK0"/>
          <bitfield caption="Programmable Clock 1 Output Disable" mask="0x00000200" name="PCK1"/>
          <bitfield caption="Programmable Clock 2 Output Disable" mask="0x00000400" name="PCK2"/>
          <bitfield caption="ISC Clock Disable" mask="0x00040000" name="ISCCK"/>
        </register>
        <register caption="System Clock Status Register" name="PMC_SCSR" offset="0x0008" rw="R" size="4">
          <bitfield caption="Processor Clock Status" mask="0x00000001" name="PCK"/>
          <bitfield caption="DDR Clock Status" mask="0x00000004" name="DDRCK"/>
          <bitfield caption="MCK2x Clock Status" mask="0x00000008" name="LCDCK"/>
          <bitfield caption="USB Host Port Clock Status" mask="0x00000040" name="UHP"/>
          <bitfield caption="USB Device Port Clock Status" mask="0x00000080" name="UDP"/>
          <bitfield caption="Programmable Clock 0 Output Status" mask="0x00000100" name="PCK0"/>
          <bitfield caption="Programmable Clock 1 Output Status" mask="0x00000200" name="PCK1"/>
          <bitfield caption="Programmable Clock 2 Output Status" mask="0x00000400" name="PCK2"/>
          <bitfield caption="ISC Clock Status" mask="0x00040000" name="ISCCK"/>
        </register>
        <register caption="Peripheral Clock Enable Register 0" name="PMC_PCER0" offset="0x0010" rw="W" size="4">
          <bitfield caption="Peripheral Clock 2 Enable" mask="0x00000004" name="PID2"/>
          <bitfield caption="Peripheral Clock 3 Enable" mask="0x00000008" name="PID3"/>
          <bitfield caption="Peripheral Clock 4 Enable" mask="0x00000010" name="PID4"/>
          <bitfield caption="Peripheral Clock 5 Enable" mask="0x00000020" name="PID5"/>
          <bitfield caption="Peripheral Clock 6 Enable" mask="0x00000040" name="PID6"/>
          <bitfield caption="Peripheral Clock 7 Enable" mask="0x00000080" name="PID7"/>
          <bitfield caption="Peripheral Clock 8 Enable" mask="0x00000100" name="PID8"/>
          <bitfield caption="Peripheral Clock 9 Enable" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral Clock 10 Enable" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral Clock 11 Enable" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral Clock 12 Enable" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral Clock 13 Enable" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral Clock 14 Enable" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral Clock 15 Enable" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral Clock 16 Enable" mask="0x00010000" name="PID16"/>
          <bitfield caption="Peripheral Clock 17 Enable" mask="0x00020000" name="PID17"/>
          <bitfield caption="Peripheral Clock 18 Enable" mask="0x00040000" name="PID18"/>
          <bitfield caption="Peripheral Clock 19 Enable" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral Clock 20 Enable" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral Clock 22 Enable" mask="0x00400000" name="PID22"/>
          <bitfield caption="Peripheral Clock 23 Enable" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral Clock 24 Enable" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral Clock 25 Enable" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral Clock 26 Enable" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral Clock 27 Enable" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral Clock 28 Enable" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral Clock 29 Enable" mask="0x20000000" name="PID29"/>
          <bitfield caption="Peripheral Clock 30 Enable" mask="0x40000000" name="PID30"/>
        </register>
        <register caption="Peripheral Clock Disable Register 0" name="PMC_PCDR0" offset="0x0014" rw="W" size="4">
          <bitfield caption="Peripheral Clock 2 Disable" mask="0x00000004" name="PID2"/>
          <bitfield caption="Peripheral Clock 3 Disable" mask="0x00000008" name="PID3"/>
          <bitfield caption="Peripheral Clock 4 Disable" mask="0x00000010" name="PID4"/>
          <bitfield caption="Peripheral Clock 5 Disable" mask="0x00000020" name="PID5"/>
          <bitfield caption="Peripheral Clock 6 Disable" mask="0x00000040" name="PID6"/>
          <bitfield caption="Peripheral Clock 7 Disable" mask="0x00000080" name="PID7"/>
          <bitfield caption="Peripheral Clock 8 Disable" mask="0x00000100" name="PID8"/>
          <bitfield caption="Peripheral Clock 9 Disable" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral Clock 10 Disable" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral Clock 11 Disable" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral Clock 12 Disable" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral Clock 13 Disable" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral Clock 14 Disable" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral Clock 15 Disable" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral Clock 16 Disable" mask="0x00010000" name="PID16"/>
          <bitfield caption="Peripheral Clock 17 Disable" mask="0x00020000" name="PID17"/>
          <bitfield caption="Peripheral Clock 18 Disable" mask="0x00040000" name="PID18"/>
          <bitfield caption="Peripheral Clock 19 Disable" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral Clock 20 Disable" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral Clock 22 Disable" mask="0x00400000" name="PID22"/>
          <bitfield caption="Peripheral Clock 23 Disable" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral Clock 24 Disable" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral Clock 25 Disable" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral Clock 26 Disable" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral Clock 27 Disable" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral Clock 28 Disable" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral Clock 29 Disable" mask="0x20000000" name="PID29"/>
          <bitfield caption="Peripheral Clock 30 Disable" mask="0x40000000" name="PID30"/>
        </register>
