Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.53/atdf/ATSAMA5D21.atdf
        <register caption="PWM Fault Status Register" name="PWM_FSR" offset="0x60" rw="R" size="4">
          <bitfield caption="Fault Input Value" mask="0x000000FF" name="FIV"/>
          <bitfield caption="Fault Status" mask="0x0000FF00" name="FS"/>
        </register>
        <register caption="PWM Fault Clear Register" name="PWM_FCR" offset="0x64" rw="W" size="4">
          <bitfield caption="Fault Clear" mask="0x000000FF" name="FCLR"/>
        </register>
        <register caption="PWM Fault Protection Value Register 1" name="PWM_FPV1" offset="0x68" rw="RW" size="4">
          <bitfield caption="Fault Protection Value for PWMH output on channel 0" mask="0x00000001" name="FPVH0"/>
          <bitfield caption="Fault Protection Value for PWMH output on channel 1" mask="0x00000002" name="FPVH1"/>
          <bitfield caption="Fault Protection Value for PWMH output on channel 2" mask="0x00000004" name="FPVH2"/>
          <bitfield caption="Fault Protection Value for PWMH output on channel 3" mask="0x00000008" name="FPVH3"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 0" mask="0x00010000" name="FPVL0"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 1" mask="0x00020000" name="FPVL1"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 2" mask="0x00040000" name="FPVL2"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 3" mask="0x00080000" name="FPVL3"/>
        </register>
        <register caption="PWM Fault Protection Enable Register" name="PWM_FPE" offset="0x6C" rw="RW" size="4">
          <bitfield caption="Fault Protection Enable for channel 0" mask="0x000000FF" name="FPE0"/>
          <bitfield caption="Fault Protection Enable for channel 1" mask="0x0000FF00" name="FPE1"/>
          <bitfield caption="Fault Protection Enable for channel 2" mask="0x00FF0000" name="FPE2"/>
          <bitfield caption="Fault Protection Enable for channel 3" mask="0xFF000000" name="FPE3"/>
        </register>
        <register caption="PWM Event Line 0 Mode Register" count="2" name="PWM_ELMR" offset="0x7C" rw="RW" size="4">
          <bitfield caption="Comparison 0 Selection" mask="0x00000001" name="CSEL0"/>
          <bitfield caption="Comparison 1 Selection" mask="0x00000002" name="CSEL1"/>
          <bitfield caption="Comparison 2 Selection" mask="0x00000004" name="CSEL2"/>
          <bitfield caption="Comparison 3 Selection" mask="0x00000008" name="CSEL3"/>
          <bitfield caption="Comparison 4 Selection" mask="0x00000010" name="CSEL4"/>
          <bitfield caption="Comparison 5 Selection" mask="0x00000020" name="CSEL5"/>
          <bitfield caption="Comparison 6 Selection" mask="0x00000040" name="CSEL6"/>
          <bitfield caption="Comparison 7 Selection" mask="0x00000080" name="CSEL7"/>
        </register>
        <register caption="PWM Spread Spectrum Register" name="PWM_SSPR" offset="0xA0" rw="RW" size="4">
          <bitfield caption="Spread Spectrum Limit Value" mask="0x00FFFFFF" name="SPRD"/>
          <bitfield caption="Spread Spectrum Counter Mode" mask="0x01000000" name="SPRDM"/>
        </register>
        <register caption="PWM Spread Spectrum Update Register" name="PWM_SSPUP" offset="0xA4" rw="W" size="4">
          <bitfield caption="Spread Spectrum Limit Value Update" mask="0x00FFFFFF" name="SPRDUP"/>
        </register>
        <register caption="PWM Stepper Motor Mode Register" name="PWM_SMMR" offset="0xB0" rw="RW" size="4">
          <bitfield caption="Gray Count Enable" mask="0x00000001" name="GCEN0"/>
          <bitfield caption="Gray Count Enable" mask="0x00000002" name="GCEN1"/>
          <bitfield caption="Down Count" mask="0x00010000" name="DOWN0"/>
          <bitfield caption="Down Count" mask="0x00020000" name="DOWN1"/>
        </register>
        <register caption="PWM Fault Protection Value 2 Register" name="PWM_FPV2" offset="0xC0" rw="RW" size="4">
          <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 0" mask="0x00000001" name="FPZH0"/>
          <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 1" mask="0x00000002" name="FPZH1"/>
          <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 2" mask="0x00000004" name="FPZH2"/>
          <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 3" mask="0x00000008" name="FPZH3"/>
          <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 0" mask="0x00010000" name="FPZL0"/>
          <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 1" mask="0x00020000" name="FPZL1"/>
          <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 2" mask="0x00040000" name="FPZL2"/>
          <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 3" mask="0x00080000" name="FPZL3"/>
        </register>
        <register caption="PWM Write Protection Control Register" name="PWM_WPCR" offset="0xE4" rw="W" size="4">
          <bitfield caption="Write Protection Command" mask="0x00000003" name="WPCMD" values="PWM_WPCR__WPCMD"/>
          <bitfield caption="Write Protection Register Group 0" mask="0x00000004" name="WPRG0"/>
          <bitfield caption="Write Protection Register Group 1" mask="0x00000008" name="WPRG1"/>
          <bitfield caption="Write Protection Register Group 2" mask="0x00000010" name="WPRG2"/>
          <bitfield caption="Write Protection Register Group 3" mask="0x00000020" name="WPRG3"/>
          <bitfield caption="Write Protection Register Group 4" mask="0x00000040" name="WPRG4"/>
          <bitfield caption="Write Protection Register Group 5" mask="0x00000080" name="WPRG5"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PWM_WPCR__WPKEY"/>
        </register>
        <register caption="PWM Write Protection Status Register" name="PWM_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protect SW Status" mask="0x00000001" name="WPSWS0"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000002" name="WPSWS1"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000004" name="WPSWS2"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000008" name="WPSWS3"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000010" name="WPSWS4"/>
          <bitfield caption="Write Protect SW Status" mask="0x00000020" name="WPSWS5"/>
          <bitfield caption="Write Protect Violation Status" mask="0x00000080" name="WPVS"/>
          <bitfield caption="Write Protect HW Status" mask="0x00000100" name="WPHWS0"/>
          <bitfield caption="Write Protect HW Status" mask="0x00000200" name="WPHWS1"/>
          <bitfield caption="Write Protect HW Status" mask="0x00000400" name="WPHWS2"/>
          <bitfield caption="Write Protect HW Status" mask="0x00000800" name="WPHWS3"/>
          <bitfield caption="Write Protect HW Status" mask="0x00001000" name="WPHWS4"/>
          <bitfield caption="Write Protect HW Status" mask="0x00002000" name="WPHWS5"/>
          <bitfield caption="Write Protect Violation Source" mask="0xFFFF0000" name="WPVSRC"/>
        </register>
        <register-group caption="PWM Comparison 0 Value Register" offset="0x130" name="PWM_CMP" size="16" count="8" name-in-module="PWM_CMP"/>
        <register-group caption="PWM Channel Mode Register" offset="0x200" name="PWM_CH_NUM" count="4" size="32" name-in-module="PWM_CH_NUM"/>
        <register caption="PWM Channel Mode Update Register (ch_num = 0)" name="PWM_CMUPD0" offset="0x400" rw="W" size="4">
          <bitfield caption="Channel Polarity Update" mask="0x00000200" name="CPOLUP"/>
          <bitfield caption="Channel Polarity Inversion Update" mask="0x00002000" name="CPOLINVUP"/>
        </register>
        <register caption="PWM Channel Mode Update Register (ch_num = 1)" name="PWM_CMUPD1" offset="0x420" rw="W" size="4">
          <bitfield caption="Channel Polarity Update" mask="0x00000200" name="CPOLUP"/>
          <bitfield caption="Channel Polarity Inversion Update" mask="0x00002000" name="CPOLINVUP"/>
        </register>
        <register caption="PWM External Trigger Register 1" name="PWM_ETRG1" offset="0x42C" rw="RW" size="4">
          <bitfield caption="Maximum Counter value" mask="0x00FFFFFF" name="MAXCNT"/>
          <bitfield caption="External Trigger Mode" mask="0x03000000" name="TRGMODE" values="PWM_ETRG1__TRGMODE"/>
          <bitfield caption="Edge Selection" mask="0x10000000" name="TRGEDGE" values="PWM_ETRG1__TRGEDGE"/>
          <bitfield caption="Filtered input" mask="0x20000000" name="TRGFILT"/>
          <bitfield caption="Trigger Source" mask="0x40000000" name="TRGSRC"/>
          <bitfield caption="Recoverable Fault Enable" mask="0x80000000" name="RFEN"/>
        </register>
