Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.53/atdf/ATSAMA5D21.atdf
        <register caption="UDPHS Interrupt Enable Register" name="UDPHS_IEN" offset="0x10" rw="RW" size="4">
          <bitfield caption="Suspend Interrupt Enable (cleared upon USB reset)" mask="0x00000002" name="DET_SUSPD"/>
          <bitfield caption="Micro-SOF Interrupt Enable (cleared upon USB reset)" mask="0x00000004" name="MICRO_SOF"/>
          <bitfield caption="SOF Interrupt Enable (cleared upon USB reset)" mask="0x00000008" name="INT_SOF"/>
          <bitfield caption="End Of Reset Interrupt Enable (cleared upon USB reset)" mask="0x00000010" name="ENDRESET"/>
          <bitfield caption="Wake Up CPU Interrupt Enable (cleared upon USB reset)" mask="0x00000020" name="WAKE_UP"/>
          <bitfield caption="End Of Resume Interrupt Enable (cleared upon USB reset)" mask="0x00000040" name="ENDOFRSM"/>
          <bitfield caption="Upstream Resume Interrupt Enable (cleared upon USB reset)" mask="0x00000080" name="UPSTR_RES"/>
          <bitfield caption="Endpoint 0 Interrupt Enable (cleared upon USB reset)" mask="0x00000100" name="EPT_0"/>
          <bitfield caption="Endpoint 1 Interrupt Enable (cleared upon USB reset)" mask="0x00000200" name="EPT_1"/>
          <bitfield caption="Endpoint 2 Interrupt Enable (cleared upon USB reset)" mask="0x00000400" name="EPT_2"/>
          <bitfield caption="Endpoint 3 Interrupt Enable (cleared upon USB reset)" mask="0x00000800" name="EPT_3"/>
          <bitfield caption="Endpoint 4 Interrupt Enable (cleared upon USB reset)" mask="0x00001000" name="EPT_4"/>
          <bitfield caption="Endpoint 5 Interrupt Enable (cleared upon USB reset)" mask="0x00002000" name="EPT_5"/>
          <bitfield caption="Endpoint 6 Interrupt Enable (cleared upon USB reset)" mask="0x00004000" name="EPT_6"/>
          <bitfield caption="Endpoint 7 Interrupt Enable (cleared upon USB reset)" mask="0x00008000" name="EPT_7"/>
          <bitfield caption="Endpoint 8 Interrupt Enable (cleared upon USB reset)" mask="0x00010000" name="EPT_8"/>
          <bitfield caption="Endpoint 9 Interrupt Enable (cleared upon USB reset)" mask="0x00020000" name="EPT_9"/>
          <bitfield caption="Endpoint 10 Interrupt Enable (cleared upon USB reset)" mask="0x00040000" name="EPT_10"/>
          <bitfield caption="Endpoint 11 Interrupt Enable (cleared upon USB reset)" mask="0x00080000" name="EPT_11"/>
          <bitfield caption="Endpoint 12 Interrupt Enable (cleared upon USB reset)" mask="0x00100000" name="EPT_12"/>
          <bitfield caption="Endpoint 13 Interrupt Enable (cleared upon USB reset)" mask="0x00200000" name="EPT_13"/>
          <bitfield caption="Endpoint 14 Interrupt Enable (cleared upon USB reset)" mask="0x00400000" name="EPT_14"/>
          <bitfield caption="Endpoint 15 Interrupt Enable (cleared upon USB reset)" mask="0x00800000" name="EPT_15"/>
          <bitfield caption="DMA Channel 1 Interrupt Enable (cleared upon USB reset)" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Enable (cleared upon USB reset)" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Enable (cleared upon USB reset)" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Enable (cleared upon USB reset)" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt Enable (cleared upon USB reset)" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt Enable (cleared upon USB reset)" mask="0x40000000" name="DMA_6"/>
          <bitfield caption="DMA Channel 7 Interrupt Enable (cleared upon USB reset)" mask="0x80000000" name="DMA_7"/>
        </register>
        <register caption="UDPHS Interrupt Status Register" name="UDPHS_INTSTA" offset="0x14" rw="R" size="4">
          <bitfield caption="Speed Status" mask="0x00000001" name="SPEED"/>
          <bitfield caption="Suspend Interrupt" mask="0x00000002" name="DET_SUSPD"/>
          <bitfield caption="Micro Start Of Frame Interrupt" mask="0x00000004" name="MICRO_SOF"/>
          <bitfield caption="Start Of Frame Interrupt" mask="0x00000008" name="INT_SOF"/>
          <bitfield caption="End Of Reset Interrupt" mask="0x00000010" name="ENDRESET"/>
          <bitfield caption="Wake Up CPU Interrupt" mask="0x00000020" name="WAKE_UP"/>
          <bitfield caption="End Of Resume Interrupt" mask="0x00000040" name="ENDOFRSM"/>
          <bitfield caption="Upstream Resume Interrupt" mask="0x00000080" name="UPSTR_RES"/>
          <bitfield caption="Endpoint 0 Interrupt (cleared upon USB reset)" mask="0x00000100" name="EPT_0"/>
          <bitfield caption="Endpoint 1 Interrupt (cleared upon USB reset)" mask="0x00000200" name="EPT_1"/>
          <bitfield caption="Endpoint 2 Interrupt (cleared upon USB reset)" mask="0x00000400" name="EPT_2"/>
          <bitfield caption="Endpoint 3 Interrupt (cleared upon USB reset)" mask="0x00000800" name="EPT_3"/>
          <bitfield caption="Endpoint 4 Interrupt (cleared upon USB reset)" mask="0x00001000" name="EPT_4"/>
          <bitfield caption="Endpoint 5 Interrupt (cleared upon USB reset)" mask="0x00002000" name="EPT_5"/>
          <bitfield caption="Endpoint 6 Interrupt (cleared upon USB reset)" mask="0x00004000" name="EPT_6"/>
          <bitfield caption="Endpoint 7 Interrupt (cleared upon USB reset)" mask="0x00008000" name="EPT_7"/>
          <bitfield caption="Endpoint 8 Interrupt (cleared upon USB reset)" mask="0x00010000" name="EPT_8"/>
          <bitfield caption="Endpoint 9 Interrupt (cleared upon USB reset)" mask="0x00020000" name="EPT_9"/>
          <bitfield caption="Endpoint 10 Interrupt (cleared upon USB reset)" mask="0x00040000" name="EPT_10"/>
          <bitfield caption="Endpoint 11 Interrupt (cleared upon USB reset)" mask="0x00080000" name="EPT_11"/>
          <bitfield caption="Endpoint 12 Interrupt (cleared upon USB reset)" mask="0x00100000" name="EPT_12"/>
          <bitfield caption="Endpoint 13 Interrupt (cleared upon USB reset)" mask="0x00200000" name="EPT_13"/>
          <bitfield caption="Endpoint 14 Interrupt (cleared upon USB reset)" mask="0x00400000" name="EPT_14"/>
          <bitfield caption="Endpoint 15 Interrupt (cleared upon USB reset)" mask="0x00800000" name="EPT_15"/>
          <bitfield caption="DMA Channel 1 Interrupt" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt" mask="0x40000000" name="DMA_6"/>
          <bitfield caption="DMA Channel 7 Interrupt" mask="0x80000000" name="DMA_7"/>
        </register>
        <register caption="UDPHS Clear Interrupt Register" name="UDPHS_CLRINT" offset="0x18" rw="W" size="4">
          <bitfield caption="Suspend Interrupt Clear" mask="0x00000002" name="DET_SUSPD"/>
          <bitfield caption="Micro Start Of Frame Interrupt Clear" mask="0x00000004" name="MICRO_SOF"/>
          <bitfield caption="Start Of Frame Interrupt Clear" mask="0x00000008" name="INT_SOF"/>
          <bitfield caption="End Of Reset Interrupt Clear" mask="0x00000010" name="ENDRESET"/>
          <bitfield caption="Wake Up CPU Interrupt Clear" mask="0x00000020" name="WAKE_UP"/>
          <bitfield caption="End Of Resume Interrupt Clear" mask="0x00000040" name="ENDOFRSM"/>
          <bitfield caption="Upstream Resume Interrupt Clear" mask="0x00000080" name="UPSTR_RES"/>
        </register>
        <register caption="UDPHS Endpoints Reset Register" name="UDPHS_EPTRST" offset="0x1C" rw="W" size="4">
          <bitfield caption="Endpoint 0 Reset" mask="0x00000001" name="EPT_0"/>
          <bitfield caption="Endpoint 1 Reset" mask="0x00000002" name="EPT_1"/>
          <bitfield caption="Endpoint 2 Reset" mask="0x00000004" name="EPT_2"/>
          <bitfield caption="Endpoint 3 Reset" mask="0x00000008" name="EPT_3"/>
          <bitfield caption="Endpoint 4 Reset" mask="0x00000010" name="EPT_4"/>
          <bitfield caption="Endpoint 5 Reset" mask="0x00000020" name="EPT_5"/>
          <bitfield caption="Endpoint 6 Reset" mask="0x00000040" name="EPT_6"/>
          <bitfield caption="Endpoint 7 Reset" mask="0x00000080" name="EPT_7"/>
          <bitfield caption="Endpoint 8 Reset" mask="0x00000100" name="EPT_8"/>
          <bitfield caption="Endpoint 9 Reset" mask="0x00000200" name="EPT_9"/>
          <bitfield caption="Endpoint 10 Reset" mask="0x00000400" name="EPT_10"/>
          <bitfield caption="Endpoint 11 Reset" mask="0x00000800" name="EPT_11"/>
          <bitfield caption="Endpoint 12 Reset" mask="0x00001000" name="EPT_12"/>
          <bitfield caption="Endpoint 13 Reset" mask="0x00002000" name="EPT_13"/>
          <bitfield caption="Endpoint 14 Reset" mask="0x00004000" name="EPT_14"/>
          <bitfield caption="Endpoint 15 Reset" mask="0x00008000" name="EPT_15"/>
        </register>
